'''Напишите функцию для разделения строки и преобразования ее в массив слов.
 "Robin Singh" ==> ["Robin", "Singh"]'''
def string_to_array(s):
    return s.split(' ')
'''Напишите программу, которая находит суммирование каждого числа от 1 до num. Число всегда будет
 положительным целым числом, большим 0. Вашей функции нужно только возвращать результат, в приведенном ниже
  примере между скобками показано, как вы достигаете этого результата, и это не является его частью, смотрите
Примеры тестов.  Например, (Ввод -> Вывод): 2 -> 3 (1 + 2)'''


def summation(num):
    return sum(range(1, num + 1))

def summation(num):
    return (1+num) * num / 2
'''Завершите функцию, которая принимает два целых числа (a, b, где a < b)
 и возвращает массив всех целых чисел между входными параметрами, включая их.'''
def between(a,b):
    return list(range(a,b+1))

def between(a,b):
    arr = []
    for i in range(a, b + 1):
        arr.append(i)
    return arr
'''Камень ножницы Бумага
Давайте играть! Вы должны вернуть, какой игрок выиграл! В случае ничьей верните Draw!.
Примеры (Ввод1, Ввод2 --> Вывод):
«ножницы», «бумага» --> «Игрок 1 выиграл!»
«ножницы», «камень» --> «Игрок 2 выиграл!»
«бумага», «бумага» --> «Рисуй!»
 "scissors", "paper" --> "Player 1 won!"
"scissors", "rock" --> "Player 2 won!"
"paper", "paper" --> "Draw!"'''
def rps(p1, p2):
    if p1=="scissors" and p2== "paper":
        return "Player 1 won!"
    if p1=="scissors" and p2 =="paper":
        return "Player 2 won!"
    elif p1 == "paper"and p2 =="paper":
        return "Draw!"