'''Напишите функцию для разделения строки и преобразования ее в массив слов.
 "Robin Singh" ==> ["Robin", "Singh"]'''
def string_to_array(s):
    return s.split(' ')
'''Напишите программу, которая находит суммирование каждого числа от 1 до num. Число всегда будет
 положительным целым числом, большим 0. Вашей функции нужно только возвращать результат, в приведенном ниже
  примере между скобками показано, как вы достигаете этого результата, и это не является его частью, смотрите
Примеры тестов.  Например, (Ввод -> Вывод): 2 -> 3 (1 + 2)'''


def summation(num):
    return sum(range(1, num + 1))

def summation(num):
    return (1+num) * num / 2
'''Завершите функцию, которая принимает два целых числа (a, b, где a < b)
 и возвращает массив всех целых чисел между входными параметрами, включая их.'''
def between(a,b):
    return list(range(a,b+1))
 
def between(a,b):
    arr = []
    for i in range(a, b + 1):
        arr.append(i)
    return arr
'''Тролли атакуют ваш раздел комментариев!
Распространенный способ справиться с этой ситуацией - убрать все гласные из комментариев троллей, нейтрализуя угрозу.
Ваша задача - написать функцию, которая принимает строку и возвращает новую строку с удаленными всеми гласными.
Например, строка "Этот веб-сайт для неудачников, ЛОЛ!" станет "Ths wbst s fr lsrs LL!".
Примечание: для этого ката y не считается гласной.'''
def disemvowel(string_):
    text = list(string_)
    for i in text[::-1]:
        if i in 'aeiouAEIOU':
            text.remove(i)
    return str(''.join(text))

def disemvowel(s):
    for i in "aeiouAEIOU":
        s = s.replace(i,'')
    return s
'''Нам нужна функция, которая может преобразовывать строку в число. Какие способы достижения этого вы знаете?
Примечание: Не волнуйтесь, все входные данные будут строками, и каждая строка является абсолютно корректным 
представлением целого числа.'''
def string_to_number(s):
    result = int(s)
    return  result
